---
kind: property
id: P:Autodesk.Revit.DB.Electrical.VoltageTypeSet.IsEmpty
source: html/fcd19cf7-ce8e-3f33-7eb1-8ff64ac5e292.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.